espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_analog_peri_reg.h
/** LP_ANALOG_PERI_TOUCH_SCAN_CTRL2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_SCAN_CTRL2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x104)
/** LP_ANALOG_PERI_TOUCH_TIMEOUT_NUM : R/W; bitpos: [21:6]; default: 65535;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_TIMEOUT_NUM    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_TIMEOUT_NUM_M  (LP_ANALOG_PERI_TOUCH_TIMEOUT_NUM_V << LP_ANALOG_PERI_TOUCH_TIMEOUT_NUM_S)
#define LP_ANALOG_PERI_TOUCH_TIMEOUT_NUM_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_TIMEOUT_NUM_S  6
/** LP_ANALOG_PERI_TOUCH_TIMEOUT_EN : R/W; bitpos: [22]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_TIMEOUT_EN    (BIT(22))
#define LP_ANALOG_PERI_TOUCH_TIMEOUT_EN_M  (LP_ANALOG_PERI_TOUCH_TIMEOUT_EN_V << LP_ANALOG_PERI_TOUCH_TIMEOUT_EN_S)
#define LP_ANALOG_PERI_TOUCH_TIMEOUT_EN_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_TIMEOUT_EN_S  22
/** LP_ANALOG_PERI_TOUCH_OUT_RING : R/W; bitpos: [26:23]; default: 15;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_OUT_RING    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_OUT_RING_M  (LP_ANALOG_PERI_TOUCH_OUT_RING_V << LP_ANALOG_PERI_TOUCH_OUT_RING_S)
#define LP_ANALOG_PERI_TOUCH_OUT_RING_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_OUT_RING_S  23
/** LP_ANALOG_PERI_FREQ_SCAN_EN : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_FREQ_SCAN_EN    (BIT(27))
#define LP_ANALOG_PERI_FREQ_SCAN_EN_M  (LP_ANALOG_PERI_FREQ_SCAN_EN_V << LP_ANALOG_PERI_FREQ_SCAN_EN_S)
#define LP_ANALOG_PERI_FREQ_SCAN_EN_V  0x00000001U
#define LP_ANALOG_PERI_FREQ_SCAN_EN_S  27
/** LP_ANALOG_PERI_FREQ_SCAN_CNT_LIMIT : R/W; bitpos: [29:28]; default: 3;
 *  need_des
 */
#define LP_ANALOG_PERI_FREQ_SCAN_CNT_LIMIT    0x00000003U
#define LP_ANALOG_PERI_FREQ_SCAN_CNT_LIMIT_M  (LP_ANALOG_PERI_FREQ_SCAN_CNT_LIMIT_V << LP_ANALOG_PERI_FREQ_SCAN_CNT_LIMIT_S)
#define LP_ANALOG_PERI_FREQ_SCAN_CNT_LIMIT_V  0x00000003U
#define LP_ANALOG_PERI_FREQ_SCAN_CNT_LIMIT_S  28

/** LP_ANALOG_PERI_TOUCH_WORK_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_WORK_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x108)
/** LP_ANALOG_PERI_DIV_NUM2 : R/W; bitpos: [18:16]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_DIV_NUM2    0x00000007U
#define LP_ANALOG_PERI_DIV_NUM2_M  (LP_ANALOG_PERI_DIV_NUM2_V << LP_ANALOG_PERI_DIV_NUM2_S)
#define LP_ANALOG_PERI_DIV_NUM2_V  0x00000007U
#define LP_ANALOG_PERI_DIV_NUM2_S  16
/** LP_ANALOG_PERI_DIV_NUM1 : R/W; bitpos: [21:19]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_DIV_NUM1    0x00000007U
#define LP_ANALOG_PERI_DIV_NUM1_M  (LP_ANALOG_PERI_DIV_NUM1_V << LP_ANALOG_PERI_DIV_NUM1_S)
#define LP_ANALOG_PERI_DIV_NUM1_V  0x00000007U
#define LP_ANALOG_PERI_DIV_NUM1_S  19
/** LP_ANALOG_PERI_DIV_NUM0 : R/W; bitpos: [24:22]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_DIV_NUM0    0x00000007U
#define LP_ANALOG_PERI_DIV_NUM0_M  (LP_ANALOG_PERI_DIV_NUM0_V << LP_ANALOG_PERI_DIV_NUM0_S)
#define LP_ANALOG_PERI_DIV_NUM0_V  0x00000007U
#define LP_ANALOG_PERI_DIV_NUM0_S  22
/** LP_ANALOG_PERI_TOUCH_OUT_SEL : R/W; bitpos: [25]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_OUT_SEL    (BIT(25))
#define LP_ANALOG_PERI_TOUCH_OUT_SEL_M  (LP_ANALOG_PERI_TOUCH_OUT_SEL_V << LP_ANALOG_PERI_TOUCH_OUT_SEL_S)
#define LP_ANALOG_PERI_TOUCH_OUT_SEL_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_OUT_SEL_S  25
/** LP_ANALOG_PERI_TOUCH_OUT_RESET : WT; bitpos: [26]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_OUT_RESET    (BIT(26))
#define LP_ANALOG_PERI_TOUCH_OUT_RESET_M  (LP_ANALOG_PERI_TOUCH_OUT_RESET_V << LP_ANALOG_PERI_TOUCH_OUT_RESET_S)
#define LP_ANALOG_PERI_TOUCH_OUT_RESET_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_OUT_RESET_S  26
/** LP_ANALOG_PERI_TOUCH_OUT_GATE : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_OUT_GATE    (BIT(27))
#define LP_ANALOG_PERI_TOUCH_OUT_GATE_M  (LP_ANALOG_PERI_TOUCH_OUT_GATE_V << LP_ANALOG_PERI_TOUCH_OUT_GATE_S)
#define LP_ANALOG_PERI_TOUCH_OUT_GATE_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_OUT_GATE_S  27

/** LP_ANALOG_PERI_TOUCH_WORK_MEAS_NUM_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_WORK_MEAS_NUM_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x10c)
/** LP_ANALOG_PERI_TOUCH_MEAS_NUM2 : R/W; bitpos: [9:0]; default: 100;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM2    0x000003FFU
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM2_M  (LP_ANALOG_PERI_TOUCH_MEAS_NUM2_V << LP_ANALOG_PERI_TOUCH_MEAS_NUM2_S)
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM2_V  0x000003FFU
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM2_S  0
/** LP_ANALOG_PERI_TOUCH_MEAS_NUM1 : R/W; bitpos: [19:10]; default: 100;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM1    0x000003FFU
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM1_M  (LP_ANALOG_PERI_TOUCH_MEAS_NUM1_V << LP_ANALOG_PERI_TOUCH_MEAS_NUM1_S)
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM1_V  0x000003FFU
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM1_S  10
/** LP_ANALOG_PERI_TOUCH_MEAS_NUM0 : R/W; bitpos: [29:20]; default: 100;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM0    0x000003FFU
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM0_M  (LP_ANALOG_PERI_TOUCH_MEAS_NUM0_V << LP_ANALOG_PERI_TOUCH_MEAS_NUM0_S)
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM0_V  0x000003FFU
#define LP_ANALOG_PERI_TOUCH_MEAS_NUM0_S  20

/** LP_ANALOG_PERI_TOUCH_FILTER1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FILTER1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x110)
/** LP_ANALOG_PERI_TOUCH_NN_DISUPDATE_BENCHMARK_EN : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_NN_DISUPDATE_BENCHMARK_EN    (BIT(0))
#define LP_ANALOG_PERI_TOUCH_NN_DISUPDATE_BENCHMARK_EN_M  (LP_ANALOG_PERI_TOUCH_NN_DISUPDATE_BENCHMARK_EN_V << LP_ANALOG_PERI_TOUCH_NN_DISUPDATE_BENCHMARK_EN_S)
#define LP_ANALOG_PERI_TOUCH_NN_DISUPDATE_BENCHMARK_EN_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_NN_DISUPDATE_BENCHMARK_EN_S  0
/** LP_ANALOG_PERI_TOUCH_HYSTERESIS : R/W; bitpos: [2:1]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_HYSTERESIS    0x00000003U
#define LP_ANALOG_PERI_TOUCH_HYSTERESIS_M  (LP_ANALOG_PERI_TOUCH_HYSTERESIS_V << LP_ANALOG_PERI_TOUCH_HYSTERESIS_S)
#define LP_ANALOG_PERI_TOUCH_HYSTERESIS_V  0x00000003U
#define LP_ANALOG_PERI_TOUCH_HYSTERESIS_S  1
/** LP_ANALOG_PERI_TOUCH_NN_THRES : R/W; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_NN_THRES    0x00000003U
#define LP_ANALOG_PERI_TOUCH_NN_THRES_M  (LP_ANALOG_PERI_TOUCH_NN_THRES_V << LP_ANALOG_PERI_TOUCH_NN_THRES_S)
#define LP_ANALOG_PERI_TOUCH_NN_THRES_V  0x00000003U
#define LP_ANALOG_PERI_TOUCH_NN_THRES_S  3
/** LP_ANALOG_PERI_TOUCH_NOISE_THRES : R/W; bitpos: [6:5]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_NOISE_THRES    0x00000003U
#define LP_ANALOG_PERI_TOUCH_NOISE_THRES_M  (LP_ANALOG_PERI_TOUCH_NOISE_THRES_V << LP_ANALOG_PERI_TOUCH_NOISE_THRES_S)
#define LP_ANALOG_PERI_TOUCH_NOISE_THRES_V  0x00000003U
#define LP_ANALOG_PERI_TOUCH_NOISE_THRES_S  5
/** LP_ANALOG_PERI_TOUCH_SMOOTH_LVL : R/W; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_SMOOTH_LVL    0x00000003U
#define LP_ANALOG_PERI_TOUCH_SMOOTH_LVL_M  (LP_ANALOG_PERI_TOUCH_SMOOTH_LVL_V << LP_ANALOG_PERI_TOUCH_SMOOTH_LVL_S)
#define LP_ANALOG_PERI_TOUCH_SMOOTH_LVL_V  0x00000003U
#define LP_ANALOG_PERI_TOUCH_SMOOTH_LVL_S  7
/** LP_ANALOG_PERI_TOUCH_JITTER_STEP : R/W; bitpos: [12:9]; default: 1;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_JITTER_STEP    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_JITTER_STEP_M  (LP_ANALOG_PERI_TOUCH_JITTER_STEP_V << LP_ANALOG_PERI_TOUCH_JITTER_STEP_S)
#define LP_ANALOG_PERI_TOUCH_JITTER_STEP_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_JITTER_STEP_S  9
/** LP_ANALOG_PERI_TOUCH_FILTER_MODE : R/W; bitpos: [15:13]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FILTER_MODE    0x00000007U
#define LP_ANALOG_PERI_TOUCH_FILTER_MODE_M  (LP_ANALOG_PERI_TOUCH_FILTER_MODE_V << LP_ANALOG_PERI_TOUCH_FILTER_MODE_S)
#define LP_ANALOG_PERI_TOUCH_FILTER_MODE_V  0x00000007U
#define LP_ANALOG_PERI_TOUCH_FILTER_MODE_S  13
/** LP_ANALOG_PERI_TOUCH_FILTER_EN : R/W; bitpos: [16]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FILTER_EN    (BIT(16))
#define LP_ANALOG_PERI_TOUCH_FILTER_EN_M  (LP_ANALOG_PERI_TOUCH_FILTER_EN_V << LP_ANALOG_PERI_TOUCH_FILTER_EN_S)
#define LP_ANALOG_PERI_TOUCH_FILTER_EN_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_FILTER_EN_S  16
/** LP_ANALOG_PERI_TOUCH_NN_LIMIT : R/W; bitpos: [20:17]; default: 5;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_NN_LIMIT    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_NN_LIMIT_M  (LP_ANALOG_PERI_TOUCH_NN_LIMIT_V << LP_ANALOG_PERI_TOUCH_NN_LIMIT_S)
#define LP_ANALOG_PERI_TOUCH_NN_LIMIT_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_NN_LIMIT_S  17
/** LP_ANALOG_PERI_TOUCH_APPROACH_LIMIT : R/W; bitpos: [28:21]; default: 80;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_APPROACH_LIMIT    0x000000FFU
#define LP_ANALOG_PERI_TOUCH_APPROACH_LIMIT_M  (LP_ANALOG_PERI_TOUCH_APPROACH_LIMIT_V << LP_ANALOG_PERI_TOUCH_APPROACH_LIMIT_S)
#define LP_ANALOG_PERI_TOUCH_APPROACH_LIMIT_V  0x000000FFU
#define LP_ANALOG_PERI_TOUCH_APPROACH_LIMIT_S  21
/** LP_ANALOG_PERI_TOUCH_DEBOUNCE_LIMIT : R/W; bitpos: [31:29]; default: 3;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_DEBOUNCE_LIMIT    0x00000007U
#define LP_ANALOG_PERI_TOUCH_DEBOUNCE_LIMIT_M  (LP_ANALOG_PERI_TOUCH_DEBOUNCE_LIMIT_V << LP_ANALOG_PERI_TOUCH_DEBOUNCE_LIMIT_S)
#define LP_ANALOG_PERI_TOUCH_DEBOUNCE_LIMIT_V  0x00000007U
#define LP_ANALOG_PERI_TOUCH_DEBOUNCE_LIMIT_S  29

/** LP_ANALOG_PERI_TOUCH_FILTER2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FILTER2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x114)
/** LP_ANALOG_PERI_TOUCH_OUTEN : R/W; bitpos: [29:15]; default: 16383;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_OUTEN    0x00007FFFU
#define LP_ANALOG_PERI_TOUCH_OUTEN_M  (LP_ANALOG_PERI_TOUCH_OUTEN_V << LP_ANALOG_PERI_TOUCH_OUTEN_S)
#define LP_ANALOG_PERI_TOUCH_OUTEN_V  0x00007FFFU
#define LP_ANALOG_PERI_TOUCH_OUTEN_S  15
/** LP_ANALOG_PERI_TOUCH_BYPASS_NOISE_THRES : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_BYPASS_NOISE_THRES    (BIT(30))
#define LP_ANALOG_PERI_TOUCH_BYPASS_NOISE_THRES_M  (LP_ANALOG_PERI_TOUCH_BYPASS_NOISE_THRES_V << LP_ANALOG_PERI_TOUCH_BYPASS_NOISE_THRES_S)
#define LP_ANALOG_PERI_TOUCH_BYPASS_NOISE_THRES_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_BYPASS_NOISE_THRES_S  30
/** LP_ANALOG_PERI_TOUCH_BYPASS_NN_THRES : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_BYPASS_NN_THRES    (BIT(31))
#define LP_ANALOG_PERI_TOUCH_BYPASS_NN_THRES_M  (LP_ANALOG_PERI_TOUCH_BYPASS_NN_THRES_V << LP_ANALOG_PERI_TOUCH_BYPASS_NN_THRES_S)
#define LP_ANALOG_PERI_TOUCH_BYPASS_NN_THRES_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_BYPASS_NN_THRES_S  31

/** LP_ANALOG_PERI_TOUCH_FILTER3_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FILTER3_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x118)
/** LP_ANALOG_PERI_TOUCH_BENCHMARK_SW : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_BENCHMARK_SW    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_BENCHMARK_SW_M  (LP_ANALOG_PERI_TOUCH_BENCHMARK_SW_V << LP_ANALOG_PERI_TOUCH_BENCHMARK_SW_S)
#define LP_ANALOG_PERI_TOUCH_BENCHMARK_SW_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_BENCHMARK_SW_S  0
/** LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_SW : WT; bitpos: [16]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_SW    (BIT(16))
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_SW_M  (LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_SW_V << LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_SW_S)
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_SW_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_SW_S  16

/** LP_ANALOG_PERI_TOUCH_SLP0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_SLP0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x11c)
/** LP_ANALOG_PERI_TOUCH_SLP_TH0 : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_SLP_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_SLP_TH0_M  (LP_ANALOG_PERI_TOUCH_SLP_TH0_V << LP_ANALOG_PERI_TOUCH_SLP_TH0_S)
#define LP_ANALOG_PERI_TOUCH_SLP_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_SLP_TH0_S  0
/** LP_ANALOG_PERI_TOUCH_SLP_CHANNEL_CLR : WT; bitpos: [16]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_SLP_CHANNEL_CLR    (BIT(16))
#define LP_ANALOG_PERI_TOUCH_SLP_CHANNEL_CLR_M  (LP_ANALOG_PERI_TOUCH_SLP_CHANNEL_CLR_V << LP_ANALOG_PERI_TOUCH_SLP_CHANNEL_CLR_S)
#define LP_ANALOG_PERI_TOUCH_SLP_CHANNEL_CLR_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_SLP_CHANNEL_CLR_S  16
/** LP_ANALOG_PERI_TOUCH_SLP_PAD : R/W; bitpos: [20:17]; default: 15;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_SLP_PAD    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_SLP_PAD_M  (LP_ANALOG_PERI_TOUCH_SLP_PAD_V << LP_ANALOG_PERI_TOUCH_SLP_PAD_S)
#define LP_ANALOG_PERI_TOUCH_SLP_PAD_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_SLP_PAD_S  17

