espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_analog_peri_reg.h
/** LP_ANALOG_PERI_TOUCH_SLP1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_SLP1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x120)
/** LP_ANALOG_PERI_TOUCH_SLP_TH2 : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_SLP_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_SLP_TH2_M  (LP_ANALOG_PERI_TOUCH_SLP_TH2_V << LP_ANALOG_PERI_TOUCH_SLP_TH2_S)
#define LP_ANALOG_PERI_TOUCH_SLP_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_SLP_TH2_S  0
/** LP_ANALOG_PERI_TOUCH_SLP_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_SLP_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_SLP_TH1_M  (LP_ANALOG_PERI_TOUCH_SLP_TH1_V << LP_ANALOG_PERI_TOUCH_SLP_TH1_S)
#define LP_ANALOG_PERI_TOUCH_SLP_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_SLP_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_CLR_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_CLR_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x124)
/** LP_ANALOG_PERI_TOUCH_CHANNEL_CLR : WT; bitpos: [14:0]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_CHANNEL_CLR    0x00007FFFU
#define LP_ANALOG_PERI_TOUCH_CHANNEL_CLR_M  (LP_ANALOG_PERI_TOUCH_CHANNEL_CLR_V << LP_ANALOG_PERI_TOUCH_CHANNEL_CLR_S)
#define LP_ANALOG_PERI_TOUCH_CHANNEL_CLR_V  0x00007FFFU
#define LP_ANALOG_PERI_TOUCH_CHANNEL_CLR_S  0
/** LP_ANALOG_PERI_TOUCH_STATUS_CLR : WT; bitpos: [15]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_STATUS_CLR    (BIT(15))
#define LP_ANALOG_PERI_TOUCH_STATUS_CLR_M  (LP_ANALOG_PERI_TOUCH_STATUS_CLR_V << LP_ANALOG_PERI_TOUCH_STATUS_CLR_S)
#define LP_ANALOG_PERI_TOUCH_STATUS_CLR_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_STATUS_CLR_S  15

/** LP_ANALOG_PERI_TOUCH_APPROACH_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_APPROACH_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x128)
/** LP_ANALOG_PERI_TOUCH_APPROACH_PAD0 : R/W; bitpos: [3:0]; default: 15;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD0    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD0_M  (LP_ANALOG_PERI_TOUCH_APPROACH_PAD0_V << LP_ANALOG_PERI_TOUCH_APPROACH_PAD0_S)
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD0_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD0_S  0
/** LP_ANALOG_PERI_TOUCH_APPROACH_PAD1 : R/W; bitpos: [7:4]; default: 15;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD1    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD1_M  (LP_ANALOG_PERI_TOUCH_APPROACH_PAD1_V << LP_ANALOG_PERI_TOUCH_APPROACH_PAD1_S)
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD1_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD1_S  4
/** LP_ANALOG_PERI_TOUCH_APPROACH_PAD2 : R/W; bitpos: [11:8]; default: 15;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD2    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD2_M  (LP_ANALOG_PERI_TOUCH_APPROACH_PAD2_V << LP_ANALOG_PERI_TOUCH_APPROACH_PAD2_S)
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD2_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_APPROACH_PAD2_S  8
/** LP_ANALOG_PERI_TOUCH_SLP_APPROACH_EN : R/W; bitpos: [12]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_SLP_APPROACH_EN    (BIT(12))
#define LP_ANALOG_PERI_TOUCH_SLP_APPROACH_EN_M  (LP_ANALOG_PERI_TOUCH_SLP_APPROACH_EN_V << LP_ANALOG_PERI_TOUCH_SLP_APPROACH_EN_S)
#define LP_ANALOG_PERI_TOUCH_SLP_APPROACH_EN_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_SLP_APPROACH_EN_S  12

/** LP_ANALOG_PERI_TOUCH_FREQ0_SCAN_PARA_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ0_SCAN_PARA_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x12c)
/** LP_ANALOG_PERI_TOUCH_FREQ0_DCAP_LPF : R/W; bitpos: [6:0]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ0_DCAP_LPF    0x0000007FU
#define LP_ANALOG_PERI_TOUCH_FREQ0_DCAP_LPF_M  (LP_ANALOG_PERI_TOUCH_FREQ0_DCAP_LPF_V << LP_ANALOG_PERI_TOUCH_FREQ0_DCAP_LPF_S)
#define LP_ANALOG_PERI_TOUCH_FREQ0_DCAP_LPF_V  0x0000007FU
#define LP_ANALOG_PERI_TOUCH_FREQ0_DCAP_LPF_S  0
/** LP_ANALOG_PERI_TOUCH_FREQ0_DRES_LPF : R/W; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRES_LPF    0x00000003U
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRES_LPF_M  (LP_ANALOG_PERI_TOUCH_FREQ0_DRES_LPF_V << LP_ANALOG_PERI_TOUCH_FREQ0_DRES_LPF_S)
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRES_LPF_V  0x00000003U
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRES_LPF_S  7
/** LP_ANALOG_PERI_TOUCH_FREQ0_DRV_LS : R/W; bitpos: [12:9]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRV_LS    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRV_LS_M  (LP_ANALOG_PERI_TOUCH_FREQ0_DRV_LS_V << LP_ANALOG_PERI_TOUCH_FREQ0_DRV_LS_S)
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRV_LS_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRV_LS_S  9
/** LP_ANALOG_PERI_TOUCH_FREQ0_DRV_HS : R/W; bitpos: [17:13]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRV_HS    0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRV_HS_M  (LP_ANALOG_PERI_TOUCH_FREQ0_DRV_HS_V << LP_ANALOG_PERI_TOUCH_FREQ0_DRV_HS_S)
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRV_HS_V  0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ0_DRV_HS_S  13
/** LP_ANALOG_PERI_TOUCH_FREQ0_DBIAS : R/W; bitpos: [22:18]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ0_DBIAS    0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ0_DBIAS_M  (LP_ANALOG_PERI_TOUCH_FREQ0_DBIAS_V << LP_ANALOG_PERI_TOUCH_FREQ0_DBIAS_S)
#define LP_ANALOG_PERI_TOUCH_FREQ0_DBIAS_V  0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ0_DBIAS_S  18

/** LP_ANALOG_PERI_TOUCH_FREQ1_SCAN_PARA_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ1_SCAN_PARA_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x130)
/** LP_ANALOG_PERI_TOUCH_FREQ1_DCAP_LPF : R/W; bitpos: [6:0]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ1_DCAP_LPF    0x0000007FU
#define LP_ANALOG_PERI_TOUCH_FREQ1_DCAP_LPF_M  (LP_ANALOG_PERI_TOUCH_FREQ1_DCAP_LPF_V << LP_ANALOG_PERI_TOUCH_FREQ1_DCAP_LPF_S)
#define LP_ANALOG_PERI_TOUCH_FREQ1_DCAP_LPF_V  0x0000007FU
#define LP_ANALOG_PERI_TOUCH_FREQ1_DCAP_LPF_S  0
/** LP_ANALOG_PERI_TOUCH_FREQ1_DRES_LPF : R/W; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRES_LPF    0x00000003U
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRES_LPF_M  (LP_ANALOG_PERI_TOUCH_FREQ1_DRES_LPF_V << LP_ANALOG_PERI_TOUCH_FREQ1_DRES_LPF_S)
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRES_LPF_V  0x00000003U
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRES_LPF_S  7
/** LP_ANALOG_PERI_TOUCH_FREQ1_DRV_LS : R/W; bitpos: [12:9]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRV_LS    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRV_LS_M  (LP_ANALOG_PERI_TOUCH_FREQ1_DRV_LS_V << LP_ANALOG_PERI_TOUCH_FREQ1_DRV_LS_S)
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRV_LS_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRV_LS_S  9
/** LP_ANALOG_PERI_TOUCH_FREQ1_DRV_HS : R/W; bitpos: [17:13]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRV_HS    0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRV_HS_M  (LP_ANALOG_PERI_TOUCH_FREQ1_DRV_HS_V << LP_ANALOG_PERI_TOUCH_FREQ1_DRV_HS_S)
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRV_HS_V  0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ1_DRV_HS_S  13
/** LP_ANALOG_PERI_TOUCH_FREQ1_DBIAS : R/W; bitpos: [22:18]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ1_DBIAS    0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ1_DBIAS_M  (LP_ANALOG_PERI_TOUCH_FREQ1_DBIAS_V << LP_ANALOG_PERI_TOUCH_FREQ1_DBIAS_S)
#define LP_ANALOG_PERI_TOUCH_FREQ1_DBIAS_V  0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ1_DBIAS_S  18

/** LP_ANALOG_PERI_TOUCH_FREQ2_SCAN_PARA_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ2_SCAN_PARA_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x134)
/** LP_ANALOG_PERI_TOUCH_FREQ2_DCAP_LPF : R/W; bitpos: [6:0]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ2_DCAP_LPF    0x0000007FU
#define LP_ANALOG_PERI_TOUCH_FREQ2_DCAP_LPF_M  (LP_ANALOG_PERI_TOUCH_FREQ2_DCAP_LPF_V << LP_ANALOG_PERI_TOUCH_FREQ2_DCAP_LPF_S)
#define LP_ANALOG_PERI_TOUCH_FREQ2_DCAP_LPF_V  0x0000007FU
#define LP_ANALOG_PERI_TOUCH_FREQ2_DCAP_LPF_S  0
/** LP_ANALOG_PERI_TOUCH_FREQ2_DRES_LPF : R/W; bitpos: [8:7]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRES_LPF    0x00000003U
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRES_LPF_M  (LP_ANALOG_PERI_TOUCH_FREQ2_DRES_LPF_V << LP_ANALOG_PERI_TOUCH_FREQ2_DRES_LPF_S)
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRES_LPF_V  0x00000003U
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRES_LPF_S  7
/** LP_ANALOG_PERI_TOUCH_FREQ2_DRV_LS : R/W; bitpos: [12:9]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRV_LS    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRV_LS_M  (LP_ANALOG_PERI_TOUCH_FREQ2_DRV_LS_V << LP_ANALOG_PERI_TOUCH_FREQ2_DRV_LS_S)
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRV_LS_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRV_LS_S  9
/** LP_ANALOG_PERI_TOUCH_FREQ2_DRV_HS : R/W; bitpos: [17:13]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRV_HS    0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRV_HS_M  (LP_ANALOG_PERI_TOUCH_FREQ2_DRV_HS_V << LP_ANALOG_PERI_TOUCH_FREQ2_DRV_HS_S)
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRV_HS_V  0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ2_DRV_HS_S  13
/** LP_ANALOG_PERI_TOUCH_FREQ2_DBIAS : R/W; bitpos: [22:18]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ2_DBIAS    0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ2_DBIAS_M  (LP_ANALOG_PERI_TOUCH_FREQ2_DBIAS_V << LP_ANALOG_PERI_TOUCH_FREQ2_DBIAS_S)
#define LP_ANALOG_PERI_TOUCH_FREQ2_DBIAS_V  0x0000001FU
#define LP_ANALOG_PERI_TOUCH_FREQ2_DBIAS_S  18

/** LP_ANALOG_PERI_TOUCH_ANA_PARA_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_ANA_PARA_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x138)
/** LP_ANALOG_PERI_TOUCH_TOUCH_BUF_DRV : R/W; bitpos: [2:0]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_TOUCH_BUF_DRV    0x00000007U
#define LP_ANALOG_PERI_TOUCH_TOUCH_BUF_DRV_M  (LP_ANALOG_PERI_TOUCH_TOUCH_BUF_DRV_V << LP_ANALOG_PERI_TOUCH_TOUCH_BUF_DRV_S)
#define LP_ANALOG_PERI_TOUCH_TOUCH_BUF_DRV_V  0x00000007U
#define LP_ANALOG_PERI_TOUCH_TOUCH_BUF_DRV_S  0
/** LP_ANALOG_PERI_TOUCH_TOUCH_EN_CAL : R/W; bitpos: [3]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_TOUCH_EN_CAL    (BIT(3))
#define LP_ANALOG_PERI_TOUCH_TOUCH_EN_CAL_M  (LP_ANALOG_PERI_TOUCH_TOUCH_EN_CAL_V << LP_ANALOG_PERI_TOUCH_TOUCH_EN_CAL_S)
#define LP_ANALOG_PERI_TOUCH_TOUCH_EN_CAL_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_TOUCH_EN_CAL_S  3
/** LP_ANALOG_PERI_TOUCH_TOUCH_DCAP_CAL : R/W; bitpos: [10:4]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_TOUCH_DCAP_CAL    0x0000007FU
#define LP_ANALOG_PERI_TOUCH_TOUCH_DCAP_CAL_M  (LP_ANALOG_PERI_TOUCH_TOUCH_DCAP_CAL_V << LP_ANALOG_PERI_TOUCH_TOUCH_DCAP_CAL_S)
#define LP_ANALOG_PERI_TOUCH_TOUCH_DCAP_CAL_V  0x0000007FU
#define LP_ANALOG_PERI_TOUCH_TOUCH_DCAP_CAL_S  4

/** LP_ANALOG_PERI_TOUCH_MUX0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_MUX0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x13c)
/** LP_ANALOG_PERI_TOUCH_DATA_SEL : R/W; bitpos: [9:8]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_DATA_SEL    0x00000003U
#define LP_ANALOG_PERI_TOUCH_DATA_SEL_M  (LP_ANALOG_PERI_TOUCH_DATA_SEL_V << LP_ANALOG_PERI_TOUCH_DATA_SEL_S)
#define LP_ANALOG_PERI_TOUCH_DATA_SEL_V  0x00000003U
#define LP_ANALOG_PERI_TOUCH_DATA_SEL_S  8
/** LP_ANALOG_PERI_TOUCH_FREQ_SEL : R/W; bitpos: [11:10]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FREQ_SEL    0x00000003U
#define LP_ANALOG_PERI_TOUCH_FREQ_SEL_M  (LP_ANALOG_PERI_TOUCH_FREQ_SEL_V << LP_ANALOG_PERI_TOUCH_FREQ_SEL_S)
#define LP_ANALOG_PERI_TOUCH_FREQ_SEL_V  0x00000003U
#define LP_ANALOG_PERI_TOUCH_FREQ_SEL_S  10
/** LP_ANALOG_PERI_TOUCH_BUFSEL : R/W; bitpos: [26:12]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_BUFSEL    0x00007FFFU
#define LP_ANALOG_PERI_TOUCH_BUFSEL_M  (LP_ANALOG_PERI_TOUCH_BUFSEL_V << LP_ANALOG_PERI_TOUCH_BUFSEL_S)
#define LP_ANALOG_PERI_TOUCH_BUFSEL_V  0x00007FFFU
#define LP_ANALOG_PERI_TOUCH_BUFSEL_S  12
/** LP_ANALOG_PERI_TOUCH_DONE_EN : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_DONE_EN    (BIT(27))
#define LP_ANALOG_PERI_TOUCH_DONE_EN_M  (LP_ANALOG_PERI_TOUCH_DONE_EN_V << LP_ANALOG_PERI_TOUCH_DONE_EN_S)
#define LP_ANALOG_PERI_TOUCH_DONE_EN_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_DONE_EN_S  27
/** LP_ANALOG_PERI_TOUCH_DONE_FORCE : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_DONE_FORCE    (BIT(28))
#define LP_ANALOG_PERI_TOUCH_DONE_FORCE_M  (LP_ANALOG_PERI_TOUCH_DONE_FORCE_V << LP_ANALOG_PERI_TOUCH_DONE_FORCE_S)
#define LP_ANALOG_PERI_TOUCH_DONE_FORCE_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_DONE_FORCE_S  28
/** LP_ANALOG_PERI_TOUCH_FSM_EN : R/W; bitpos: [29]; default: 1;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_FSM_EN    (BIT(29))
#define LP_ANALOG_PERI_TOUCH_FSM_EN_M  (LP_ANALOG_PERI_TOUCH_FSM_EN_V << LP_ANALOG_PERI_TOUCH_FSM_EN_S)
#define LP_ANALOG_PERI_TOUCH_FSM_EN_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_FSM_EN_S  29
/** LP_ANALOG_PERI_TOUCH_START_EN : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_START_EN    (BIT(30))
#define LP_ANALOG_PERI_TOUCH_START_EN_M  (LP_ANALOG_PERI_TOUCH_START_EN_V << LP_ANALOG_PERI_TOUCH_START_EN_S)
#define LP_ANALOG_PERI_TOUCH_START_EN_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_START_EN_S  30
/** LP_ANALOG_PERI_TOUCH_START_FORCE : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_START_FORCE    (BIT(31))
#define LP_ANALOG_PERI_TOUCH_START_FORCE_M  (LP_ANALOG_PERI_TOUCH_START_FORCE_V << LP_ANALOG_PERI_TOUCH_START_FORCE_S)
#define LP_ANALOG_PERI_TOUCH_START_FORCE_V  0x00000001U
#define LP_ANALOG_PERI_TOUCH_START_FORCE_S  31

