espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_analog_peri_reg.h
/** LP_ANALOG_PERI_TOUCH_MUX1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_MUX1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x140)
/** LP_ANALOG_PERI_TOUCH_START : R/W; bitpos: [14:0]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_START    0x00007FFFU
#define LP_ANALOG_PERI_TOUCH_START_M  (LP_ANALOG_PERI_TOUCH_START_V << LP_ANALOG_PERI_TOUCH_START_S)
#define LP_ANALOG_PERI_TOUCH_START_V  0x00007FFFU
#define LP_ANALOG_PERI_TOUCH_START_S  0
/** LP_ANALOG_PERI_TOUCH_XPD : R/W; bitpos: [29:15]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_XPD    0x00007FFFU
#define LP_ANALOG_PERI_TOUCH_XPD_M  (LP_ANALOG_PERI_TOUCH_XPD_V << LP_ANALOG_PERI_TOUCH_XPD_S)
#define LP_ANALOG_PERI_TOUCH_XPD_V  0x00007FFFU
#define LP_ANALOG_PERI_TOUCH_XPD_S  15

/** LP_ANALOG_PERI_TOUCH_PAD0_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD0_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x144)
/** LP_ANALOG_PERI_TOUCH_PAD0_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD0_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD0_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD0_TH0_V << LP_ANALOG_PERI_TOUCH_PAD0_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD0_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD0_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD0_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD0_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x148)
/** LP_ANALOG_PERI_TOUCH_PAD0_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD0_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD0_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD0_TH1_V << LP_ANALOG_PERI_TOUCH_PAD0_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD0_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD0_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD0_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD0_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x14c)
/** LP_ANALOG_PERI_TOUCH_PAD0_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD0_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD0_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD0_TH2_V << LP_ANALOG_PERI_TOUCH_PAD0_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD0_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD0_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD1_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD1_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x150)
/** LP_ANALOG_PERI_TOUCH_PAD1_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD1_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD1_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD1_TH0_V << LP_ANALOG_PERI_TOUCH_PAD1_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD1_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD1_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD1_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD1_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x154)
/** LP_ANALOG_PERI_TOUCH_PAD1_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD1_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD1_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD1_TH1_V << LP_ANALOG_PERI_TOUCH_PAD1_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD1_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD1_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD1_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD1_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x158)
/** LP_ANALOG_PERI_TOUCH_PAD1_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD1_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD1_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD1_TH2_V << LP_ANALOG_PERI_TOUCH_PAD1_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD1_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD1_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD2_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD2_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x15c)
/** LP_ANALOG_PERI_TOUCH_PAD2_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD2_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD2_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD2_TH0_V << LP_ANALOG_PERI_TOUCH_PAD2_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD2_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD2_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD2_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD2_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x160)
/** LP_ANALOG_PERI_TOUCH_PAD2_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD2_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD2_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD2_TH1_V << LP_ANALOG_PERI_TOUCH_PAD2_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD2_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD2_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD2_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD2_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x164)
/** LP_ANALOG_PERI_TOUCH_PAD2_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD2_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD2_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD2_TH2_V << LP_ANALOG_PERI_TOUCH_PAD2_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD2_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD2_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD3_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD3_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x168)
/** LP_ANALOG_PERI_TOUCH_PAD3_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD3_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD3_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD3_TH0_V << LP_ANALOG_PERI_TOUCH_PAD3_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD3_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD3_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD3_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD3_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x16c)
/** LP_ANALOG_PERI_TOUCH_PAD3_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD3_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD3_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD3_TH1_V << LP_ANALOG_PERI_TOUCH_PAD3_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD3_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD3_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD3_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD3_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x170)
/** LP_ANALOG_PERI_TOUCH_PAD3_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD3_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD3_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD3_TH2_V << LP_ANALOG_PERI_TOUCH_PAD3_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD3_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD3_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD4_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD4_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x174)
/** LP_ANALOG_PERI_TOUCH_PAD4_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD4_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD4_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD4_TH0_V << LP_ANALOG_PERI_TOUCH_PAD4_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD4_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD4_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD4_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD4_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x178)
/** LP_ANALOG_PERI_TOUCH_PAD4_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD4_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD4_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD4_TH1_V << LP_ANALOG_PERI_TOUCH_PAD4_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD4_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD4_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD4_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD4_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x17c)
/** LP_ANALOG_PERI_TOUCH_PAD4_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD4_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD4_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD4_TH2_V << LP_ANALOG_PERI_TOUCH_PAD4_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD4_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD4_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD5_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD5_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x180)
/** LP_ANALOG_PERI_TOUCH_PAD5_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD5_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD5_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD5_TH0_V << LP_ANALOG_PERI_TOUCH_PAD5_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD5_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD5_TH0_S  16

