espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_analog_peri_reg.h
/** LP_ANALOG_PERI_TOUCH_PAD5_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD5_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x184)
/** LP_ANALOG_PERI_TOUCH_PAD5_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD5_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD5_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD5_TH1_V << LP_ANALOG_PERI_TOUCH_PAD5_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD5_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD5_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD5_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD5_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x188)
/** LP_ANALOG_PERI_TOUCH_PAD5_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD5_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD5_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD5_TH2_V << LP_ANALOG_PERI_TOUCH_PAD5_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD5_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD5_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD6_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD6_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x18c)
/** LP_ANALOG_PERI_TOUCH_PAD6_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD6_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD6_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD6_TH0_V << LP_ANALOG_PERI_TOUCH_PAD6_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD6_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD6_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD6_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD6_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x190)
/** LP_ANALOG_PERI_TOUCH_PAD6_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD6_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD6_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD6_TH1_V << LP_ANALOG_PERI_TOUCH_PAD6_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD6_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD6_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD6_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD6_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x194)
/** LP_ANALOG_PERI_TOUCH_PAD6_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD6_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD6_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD6_TH2_V << LP_ANALOG_PERI_TOUCH_PAD6_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD6_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD6_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD7_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD7_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x198)
/** LP_ANALOG_PERI_TOUCH_PAD7_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD7_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD7_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD7_TH0_V << LP_ANALOG_PERI_TOUCH_PAD7_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD7_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD7_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD7_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD7_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x19c)
/** LP_ANALOG_PERI_TOUCH_PAD7_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD7_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD7_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD7_TH1_V << LP_ANALOG_PERI_TOUCH_PAD7_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD7_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD7_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD7_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD7_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1a0)
/** LP_ANALOG_PERI_TOUCH_PAD7_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD7_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD7_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD7_TH2_V << LP_ANALOG_PERI_TOUCH_PAD7_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD7_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD7_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD8_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD8_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1a4)
/** LP_ANALOG_PERI_TOUCH_PAD8_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD8_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD8_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD8_TH0_V << LP_ANALOG_PERI_TOUCH_PAD8_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD8_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD8_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD8_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD8_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1a8)
/** LP_ANALOG_PERI_TOUCH_PAD8_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD8_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD8_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD8_TH1_V << LP_ANALOG_PERI_TOUCH_PAD8_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD8_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD8_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD8_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD8_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1ac)
/** LP_ANALOG_PERI_TOUCH_PAD8_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD8_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD8_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD8_TH2_V << LP_ANALOG_PERI_TOUCH_PAD8_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD8_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD8_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD9_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD9_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1b0)
/** LP_ANALOG_PERI_TOUCH_PAD9_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD9_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD9_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD9_TH0_V << LP_ANALOG_PERI_TOUCH_PAD9_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD9_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD9_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD9_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD9_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1b4)
/** LP_ANALOG_PERI_TOUCH_PAD9_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD9_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD9_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD9_TH1_V << LP_ANALOG_PERI_TOUCH_PAD9_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD9_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD9_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD9_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD9_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1b8)
/** LP_ANALOG_PERI_TOUCH_PAD9_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD9_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD9_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD9_TH2_V << LP_ANALOG_PERI_TOUCH_PAD9_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD9_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD9_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD10_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD10_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1bc)
/** LP_ANALOG_PERI_TOUCH_PAD10_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD10_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD10_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD10_TH0_V << LP_ANALOG_PERI_TOUCH_PAD10_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD10_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD10_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD10_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD10_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1c0)
/** LP_ANALOG_PERI_TOUCH_PAD10_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD10_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD10_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD10_TH1_V << LP_ANALOG_PERI_TOUCH_PAD10_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD10_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD10_TH1_S  16

