espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/lp_analog_peri_reg.h
/** LP_ANALOG_PERI_TOUCH_PAD10_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD10_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1c4)
/** LP_ANALOG_PERI_TOUCH_PAD10_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD10_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD10_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD10_TH2_V << LP_ANALOG_PERI_TOUCH_PAD10_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD10_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD10_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD11_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD11_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1c8)
/** LP_ANALOG_PERI_TOUCH_PAD11_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD11_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD11_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD11_TH0_V << LP_ANALOG_PERI_TOUCH_PAD11_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD11_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD11_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD11_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD11_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1cc)
/** LP_ANALOG_PERI_TOUCH_PAD11_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD11_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD11_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD11_TH1_V << LP_ANALOG_PERI_TOUCH_PAD11_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD11_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD11_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD11_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD11_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1d0)
/** LP_ANALOG_PERI_TOUCH_PAD11_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD11_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD11_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD11_TH2_V << LP_ANALOG_PERI_TOUCH_PAD11_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD11_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD11_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD12_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD12_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1d4)
/** LP_ANALOG_PERI_TOUCH_PAD12_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD12_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD12_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD12_TH0_V << LP_ANALOG_PERI_TOUCH_PAD12_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD12_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD12_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD12_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD12_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1d8)
/** LP_ANALOG_PERI_TOUCH_PAD12_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD12_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD12_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD12_TH1_V << LP_ANALOG_PERI_TOUCH_PAD12_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD12_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD12_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD12_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD12_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1dc)
/** LP_ANALOG_PERI_TOUCH_PAD12_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD12_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD12_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD12_TH2_V << LP_ANALOG_PERI_TOUCH_PAD12_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD12_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD12_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD13_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD13_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1e0)
/** LP_ANALOG_PERI_TOUCH_PAD13_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD13_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD13_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD13_TH0_V << LP_ANALOG_PERI_TOUCH_PAD13_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD13_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD13_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD13_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD13_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1e4)
/** LP_ANALOG_PERI_TOUCH_PAD13_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD13_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD13_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD13_TH1_V << LP_ANALOG_PERI_TOUCH_PAD13_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD13_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD13_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD13_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD13_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1e8)
/** LP_ANALOG_PERI_TOUCH_PAD13_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD13_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD13_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD13_TH2_V << LP_ANALOG_PERI_TOUCH_PAD13_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD13_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD13_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_PAD14_TH0_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD14_TH0_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1ec)
/** LP_ANALOG_PERI_TOUCH_PAD14_TH0 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD14_TH0    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD14_TH0_M  (LP_ANALOG_PERI_TOUCH_PAD14_TH0_V << LP_ANALOG_PERI_TOUCH_PAD14_TH0_S)
#define LP_ANALOG_PERI_TOUCH_PAD14_TH0_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD14_TH0_S  16

/** LP_ANALOG_PERI_TOUCH_PAD14_TH1_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD14_TH1_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1f0)
/** LP_ANALOG_PERI_TOUCH_PAD14_TH1 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD14_TH1    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD14_TH1_M  (LP_ANALOG_PERI_TOUCH_PAD14_TH1_V << LP_ANALOG_PERI_TOUCH_PAD14_TH1_S)
#define LP_ANALOG_PERI_TOUCH_PAD14_TH1_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD14_TH1_S  16

/** LP_ANALOG_PERI_TOUCH_PAD14_TH2_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_TOUCH_PAD14_TH2_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1f4)
/** LP_ANALOG_PERI_TOUCH_PAD14_TH2 : R/W; bitpos: [31:16]; default: 0;
 *  Reserved
 */
#define LP_ANALOG_PERI_TOUCH_PAD14_TH2    0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD14_TH2_M  (LP_ANALOG_PERI_TOUCH_PAD14_TH2_V << LP_ANALOG_PERI_TOUCH_PAD14_TH2_S)
#define LP_ANALOG_PERI_TOUCH_PAD14_TH2_V  0x0000FFFFU
#define LP_ANALOG_PERI_TOUCH_PAD14_TH2_S  16

/** LP_ANALOG_PERI_TOUCH_CTRL_REG register
 *  Touch Control Register
 */
#define LP_ANALOG_PERI_TOUCH_CTRL_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x1fc)
/** LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_FREQ_SEL : R/W; bitpos: [1:0]; default: 0;
 *  Configure the frequency point for software to update the baseline
 */
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_FREQ_SEL    0x00000003U
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_FREQ_SEL_M  (LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_FREQ_SEL_V << LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_FREQ_SEL_S)
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_FREQ_SEL_V  0x00000003U
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_FREQ_SEL_S  0
/** LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_PAD_SEL : R/W; bitpos: [5:2]; default: 0;
 *  Configure the channel for software to update the baseline.
 */
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_PAD_SEL    0x0000000FU
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_PAD_SEL_M  (LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_PAD_SEL_V << LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_PAD_SEL_S)
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_PAD_SEL_V  0x0000000FU
#define LP_ANALOG_PERI_TOUCH_UPDATE_BENCHMARK_PAD_SEL_S  2
/** LP_ANALOG_PERI_FREQ_SCAN_CNT_RISE : R/W; bitpos: [7:6]; default: 1;
 *  Configure the number of hit frequency points that need to be determined for touch
 *  in frequency hopping mode.
 */
#define LP_ANALOG_PERI_FREQ_SCAN_CNT_RISE    0x00000003U
#define LP_ANALOG_PERI_FREQ_SCAN_CNT_RISE_M  (LP_ANALOG_PERI_FREQ_SCAN_CNT_RISE_V << LP_ANALOG_PERI_FREQ_SCAN_CNT_RISE_S)
#define LP_ANALOG_PERI_FREQ_SCAN_CNT_RISE_V  0x00000003U
#define LP_ANALOG_PERI_FREQ_SCAN_CNT_RISE_S  6

/** LP_ANALOG_PERI_DATE_REG register
 *  need_des
 */
#define LP_ANALOG_PERI_DATE_REG (DR_REG_LP_ANALOG_PERI_BASE + 0x3fc)
/** LP_ANALOG_PERI_LP_ANALOG_PERI_DATE : R/W; bitpos: [30:0]; default: 2425376;
 *  need_des
 */
#define LP_ANALOG_PERI_LP_ANALOG_PERI_DATE    0x7FFFFFFFU
#define LP_ANALOG_PERI_LP_ANALOG_PERI_DATE_M  (LP_ANALOG_PERI_LP_ANALOG_PERI_DATE_V << LP_ANALOG_PERI_LP_ANALOG_PERI_DATE_S)
#define LP_ANALOG_PERI_LP_ANALOG_PERI_DATE_V  0x7FFFFFFFU
#define LP_ANALOG_PERI_LP_ANALOG_PERI_DATE_S  0
/** LP_ANALOG_PERI_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_ANALOG_PERI_CLK_EN    (BIT(31))
#define LP_ANALOG_PERI_CLK_EN_M  (LP_ANALOG_PERI_CLK_EN_V << LP_ANALOG_PERI_CLK_EN_S)
#define LP_ANALOG_PERI_CLK_EN_V  0x00000001U
#define LP_ANALOG_PERI_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
